function [v,w,q,r0]=heviside_2(rs,l,L0,C0,R0,rl)
% –аспределение (посто€нных) тока и напр€жени€ вдоль линии с потер€ми 
% при подаче на еЄ вход единичного скачка э.д.с.
% в установившемс€ режиме (при t, стрем€щемс€ к бесконечности)
% в предположении, что выполнено условие ’евисайда,
% при произвольных (омических) сопротивлени€х источника rs и нагрузки rl;
% размерности: rs, rl,  w, r0 Ц [ќм]; l Ц [м]; L0 Ц [√н/м]; C0 Ц [‘/м]; 
% R0 Ц [ќм/м]; v Ц [м/с]; q Ц [1/с]. 

% ѕримеры обращени€:
% heviside_2(0,6,0.4e-6,7e-11,0.5,7.5e9);
% heviside_2(7.5,6,0.4e-6,7e-11,0.5,750);

v=1/sqrt(L0*C0); w=sqrt(L0/C0); q=R0/L0;
tau=l/v; b=exp(2*q*tau);
p=1/((rl+w)*(rs+w)*b-(rl-w)*(rs-w));
A=p*w*(rl+w)*b;
B=p*w*(rl-w);

% r0 -входное сопротивление, ќм
r0=((rl+w)*b+(rl-w))*w/((rl+w)*b-(rl-w));

x=0:0.01:l; % x - рассто€ние вдоль линии от еЄ начала, м 
u=p*w*((rl+w)*b*exp(-q*x/v)+(rl-w)*exp(q*x/v));
i=p*((rl+w)*b*exp(-q*x/v)-(rl-w)*exp(q*x/v));

figure; plot(x,u); grid on;
xlabel('x, [m]');
ylabel('voltage, [V]');
figure; plot(x,i); grid on; 
xlabel('x, [m]');
ylabel('current, [A]');
 
o=o;
