function [v,w,q,i0]=heviside_1(zs,l,L0,C0,R0,zl)
% –аспределение (посто€нных) тока и напр€жени€ вдоль линии, 
% разомкнутой на дальнем конце,
% при подаче на еЄ вход единичного скачка напр€жени€
% в установившемс€ режиме (при t, стрем€щемс€ к бесконечности)


% ѕример обращени€:
% heviside_1(0,6,0.4*10^(-6),7*10^(-11),0.5,7.5*10^9);

v=1/sqrt(L0*C0); w=sqrt(L0/C0); q=R0/L0;
 
b=exp(2*q*l/v)
i0=tanh(q*l/v)/w;

x=0:0.01:l; 
i=(b*exp(-q*x/v)-exp(q*x/v))/(b+1)/w;
u=(b*exp(-q*x/v)+exp(q*x/v))/(b+1);

plot(x,i); grid on; figure;
plot(x,u); grid on; figure;
figure;